import React from "react";

export const TextComponent = () => (
  <>
    <h1>Перспективы фронтендера на рынке труда</h1>

    <p>
      <em>
        <strong>Есть много плюсов в том</strong>, чтобы начать/продолжить
        карьеру в качестве фронтенд-разработчика
      </em>
    </p>

    <hr />

    <h2>Плюсы</h2>

    <ul>
      <li>
        <s>Экономические</s>
      </li>
      <li>
        <mark>Перспективы развития.</mark>
      </li>
      <li>Востребованность на рынке</li>
    </ul>

    <h3>Экономические плюсы</h3>
    <p>
      <small>Фронтенд будет востребован в течение многих лет,</small>
      <br /> так как все больше компаний нуждаются в качественных, быстрых
      интерфейсах.
    </p>

    <hr />
    <h2>Формулы</h2>
    <p>
      {" "}
      (sinх)<sup>2</sup> -(cosх)<sup>2</sup> =1-(cosх)<sup>2</sup> -(cosх)
      <sup>2</sup> ={" "}
      <mark>
        1-2(cosх)<sup>2</sup>
      </mark>
    </p>
    <p>
      <b>
        <s>
          C<sub>17</sub>H<sub>21</sub>NO<sub>4</sub>
        </s>
      </b>
    </p>
  </>
);
